material.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-20 Tue 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Material</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../globalStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="index.html">↩</a></div><div id="content" class="content">
<h1 class="title">Material</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5be3f5f">Assignments</a></li>
<li><a href="#orgecc1981">Discussions</a></li>
<li><a href="#org2aa0b35">Code</a></li>
<li><a href="#org591f3b7">Slides</a></li>
<li><a href="#org62fd016">Midterm</a></li>
<li><a href="#orgb943c09">Final</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5be3f5f" class="outline-2">
<h2 id="org5be3f5f">Assignments</h2>
<div class="outline-text-2" id="text-org5be3f5f">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-orgecc1981" class="outline-2">
<h2 id="orgecc1981">Discussions</h2>
<div class="outline-text-2" id="text-orgecc1981">
<ol class="org-ol">
<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>

<li></li>
</ol>
</div>
</div>
<div id="outline-container-org2aa0b35" class="outline-2">
<h2 id="org2aa0b35">Code</h2>
</div>
<div id="outline-container-org591f3b7" class="outline-2">
<h2 id="org591f3b7">Slides</h2>
<div class="outline-text-2" id="text-org591f3b7">
</div>
<ul class="org-ul">
<li><a id="org52c9e62"></a>Linear Equations<br /></li>
<li><a id="org5fc86cc"></a>Gaussian Elimination<br /></li>
<li><a id="orgc41791b"></a>Vector Equations<br /></li>
<li><a id="orgd57d4e7"></a>Matrix-Vector Equations<br /></li>
<li><a id="org038ef82"></a>Linear Independence<br /></li>
<li><a id="orge6cb2e2"></a>Numerics and NumPy<br /></li>
<li><a id="org0afe330"></a>Linear Transformations<br /></li>
<li><a id="orgd018072"></a>Matrices of Linear Transformations<br /></li>
<li><a id="org73b4821"></a>Matrix Algebra<br /></li>
<li><a id="orgff55df5"></a>Numerics and NumPy<br /></li>
<li><a id="org3f021d2"></a>Matrix Inverse<br /></li>
<li><a id="org9b2e570"></a>Invertible Matrix Theorem<br /></li>
<li><a id="org2c7c00b"></a>Algebraic Graph Theory<br /></li>
<li><a id="org28d9ba3"></a>Markov Chains<br /></li>
<li><a id="orgc48a979"></a>Matrix Factorization<br /></li>
<li><a id="org4f795a5"></a>Computer Graphics<br /></li>
<li><a id="orgd802f5d"></a>Subspaces<br /></li>
<li><a id="orgee1aee5"></a>Dimension and Rank<br /></li>
<li><a id="orgc5d3fff"></a>Eigenvalues and Eigenvectors<br /></li>
<li><a id="org2a43a14"></a>The Characteristic Equation<br /></li>
<li><a id="org72189ff"></a>Diagonalization<br /></li>
<li><a id="org56f40bb"></a>Orthogonality<br /></li>
<li><a id="org4da7314"></a>PageRank<br /></li>
<li><a id="org04c9176"></a>Orthogonal Projection<br /></li>
<li><a id="org2ab7054"></a>Least Squares<br /></li>
<li><a id="orgde23420"></a>Linear Models<br /></li>
</ul>
</div>
<div id="outline-container-org62fd016" class="outline-2">
<h2 id="org62fd016">Midterm</h2>
</div>
<div id="outline-container-orgb943c09" class="outline-2">
<h2 id="orgb943c09">Final</h2>
</div>
</div>
</body>
</html>
